# =========================
# Taps
# =========================
tap "buildpacks/tap"
tap "fairwindsops/tap"
tap "fastly/tap"
tap "supabase/tap"
tap "weaveworks/tap"

# =========================
# Runtime version manager
# =========================
brew "mise"

# =========================
# Python package manager
# =========================
brew "uv"
brew "pipx"

# =========================
# Rust toolchain
# =========================
brew "rustup"

# =========================
# Core dev tools
# =========================
brew "git"
brew "gh"
brew "git-delta"
brew "git-secret"
brew "git-secrets"

# =========================
# Shell utilities
# =========================
brew "bat"
brew "direnv"
brew "jq"
brew "yq"
brew "peco"
brew "tree"
brew "pv"
brew "pwgen"
brew "tmux"
brew "watch"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# =========================
# Cloud / infra
# =========================
brew "awscurl"
brew "aws-elasticbeanstalk"
brew "aws-sam-cli"
brew "weaveworks/tap/eksctl"
brew "sops"
brew "firebase-cli"
brew "fastly/tap/fastly"
brew "supabase/tap/supabase"

# =========================
# Kubernetes
# =========================
brew "helmfile"
brew "kubeconform"
brew "fairwindsops/tap/pluto"
brew "pinact"

# =========================
# Code quality
# =========================
brew "actionlint"
brew "act"
brew "clang-format"
brew "cruft"
brew "hcl2json"
brew "sqlfluff"
brew "yamllint"

# =========================
# Languages (non-mise managed)
# =========================
brew "deno"

# =========================
# Build tools
# =========================
brew "go-task"
brew "buildpacks/tap/pack"

# =========================
# Database clients
# =========================
brew "mysql-client"
brew "mysql@8.0"
brew "postgresql@14"
brew "freetds"

# =========================
# Media / other
# =========================
brew "ffmpeg"

# =========================
# Casks
# =========================
cask "font-hackgen"
